/*
	微软的面试题
	有100个房间 每个房间有一盏灯 默认是关的
	现在有100个人排成一队
	每个人来到每个房间前 测试
	如果房间编号能把人的编号 整除 就拉灯
	..
	当100个人拉完之后 哪些灯是亮的

	1  4  9  16  25  36  49  64  81  100

	24

	1*24 = 24
	2*12 = 24
	3*8  = 24
	4*6  = 24
	6*4  = 24
	8*3  = 24
	12*2 = 24
	24*1 = 24
*/
public class ExecArray4{
	public static void main(String[] args){
		boolean[] lights = new boolean[100];
		for(int 人的编号 = 1;人的编号<=100;人的编号++){//有100个人
			for(int 房间编号 = 人的编号;房间编号<=100;房间编号+=人的编号){//有100个房间
				if(房间编号 % 人的编号 == 0){
					lights[房间编号-1] = !lights[房间编号-1];
				}
			}
		}//100个人100个房间的拉灯过程已经完全结束
		for(int i = 0;i<lights.length;i++){
			if(lights[i]){
				System.out.println(i+1);
			}
		}

	}
}